Revit 2027 API
ComponentRepeaterIterator.GetCurrent Method
 Returns the current repeater slot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ComponentRepeaterSlot GetCurrent()
Public Function GetCurrent As ComponentRepeaterSlot
public:
ComponentRepeaterSlot^ GetCurrent()
member GetCurrent : unit -> ComponentRepeaterSlot
Return Value
ComponentRepeaterSlot
 The current slot.
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
See Also
Reference
ComponentRepeaterIterator Class
Autodesk.Revit.DB Namespace